// 曲线名词
// 


// 四叶玫瑰线：p=aCOS2x或p=aSin2x(x是sida）
// 三叶玫瑰线：p=aCOS3x或p=aSin3x (x是sida）
// 伯努利双纽线：p^2=a^2*COS2x或p^2=a^2Sin2x (x是sida）
// 星形线：x^2/3+y^2/3 =a^2/3
// 心形线：x^2+y^2+ax=a√(x^2+y^2）
// 笛卡儿叶形线:x^3+y^3-3axy=0
// 蔓叶线：y^2*(2a-x)=x^3
// 双曲螺线:px=a(x是sida）
// 阿基米德螺线:p=ax(x是sida）
// 箕舌线：y=8a^3/(x^2+4a^2)
// 摆线:x=a（&-Sin&),y=a(1-COS&），（&是sida）
// 对数螺线p=e^ax(x是sida）
// 概率曲线：y=e^（-x^2)
// 半立方抛物线：y^2=aX^2
// 三次抛物线：y=x^3

// 阿基米德螺旋曲线
// 可以三等分任意角
// 费马螺线
// 数学中等角螺线的一种
// 玫瑰线
// 卡西尼卵形线
// 马鞍面
// 皮亚诺曲线
// 圆锥曲线
// 维维安尼曲线
// 悬链线
// 数学曲线
	


// --------------------------------
// 
// 
// 函数图形 
// 基本初等函数
// 幂函数（1)
// 数学函数图像大全
// 幂函数（2)
// 数学函数图像大全
// 幂函数（3)
// 数学函数图像大全
// 指数函数（1）
// 数学函数图像大全
// 指数函数（2）
// 数学函数图像大全
// 指数函数（3）
// 数学函数图像大全
// 对数函数（1）
// 数学函数图像大全
// 对数函数（2）
// 数学函数图像大全
// 三角函数（1）
// 数学函数图像大全
// 三角函数（2）
// 数学函数图像大全
// 三角函数（3）
// 数学函数图像大全
// 三角函数（4）
// 数学函数图像大全
// 三角函数（5）
// 数学函数图像大全
// 反三角函数（1）
// 数学函数图像大全
// 反三角函数（2）
// 数学函数图像大全
// 反三角函数（3）
// 数学函数图像大全
// 反三角函数（4）
// 数学函数图像大全
// 反三角函数（5）
// 数学函数图像大全
// 反三角函数（6）
// 数学函数图像大全
// 反三角函数（7）
// 数学函数图像大全
// 反三角函数（8）
// 数学函数图像大全
// 双曲函数（1）
// 数学函数图像大全
// 双曲函数（2）
// 数学函数图像大全
// 双曲函数（3）
// 数学函数图像大全
// 双曲函数（4）
// 数学函数图像大全
// 双曲函数（5）
// 数学函数图像大全
// 双曲函数（6）
// 数学函数图像大全
// 双曲函数（7）
// 数学函数图像大全
// 反双曲函数（1）
// 数学函数图像大全
// 反双曲函数（2）
// 数学函数图像大全
// 反双曲函数（3）
// 数学函数图像大全
// 反双曲函数（4）
// 数学函数图像大全
// 反双曲函数（5）
// 数学函数图像大全
// 反双曲函数（6）
// 数学函数图像大全
//  y=sin(1/x) (1)
// 数学函数图像大全
// y=sin(1/x) (2)
// 数学函数图像大全
// y=sin(1/x) (3)
// 数学函数图像大全
// y=sin(1/x) (4)
// 数学函数图像大全


// y = [1/x](1)
// 数学函数图像大全
// y = [1/x](2)
// 数学函数图像大全
// 

// 椭圆方程
// 圆方程

// 二次贝塞尔曲线
// 三次贝塞尔曲线
// 波形方程
// 双曲线方程
// 抛物线方程
// 
